export const applyFormMessage = {
  firstName: {
    required: "กรุณาระบุ",
  },
  firstName: {
    required: "กรุณาระบุ ชื่อ",
  },
  lastName: {
    required: "กรุณาระบุ นามสกุล",
  },
  idCard: {
    required: "กรุณาระบุ เลขที่บัตรประชาชน",
    minlength: "เลขที่บัตรประชาชนไม่ครบถ้วน",
    maxlength: "เลขที่บัตรประชาชนรูปแบบไม่ถูกต้อง",
    pattern: "เลขที่บัตรประชาชนรูปแบบไม่ถูกต้อง",
  },
  phone: {
    required: "กรุณาระบุ เบอร์โทรศัพท์มือถือ",
    minlength: "เบอร์โทรศัพท์มือถือไม่ครบถ้วน",
    maxlength: "เบอร์โทรศัพท์มือถือไม่ครบถ้วน",
    // pattern: "เบอร์โทรศัพท์มือถือรูปแบบไม่ถูกต้อง",
  },
  dateOfBirth: {
    required: "กรุณาระบุ วัน/เดือน/ปี เกิด",
    dateFormat: "กรุณาระบุ วัน/เดือน/ปี เกิด",
    // max: "ผู้สมัครต้องมีอายุระหว่าง 20-55 ปี ณ วันที่สมัคร",
    // min: "ผู้สมัครต้องมีอายุระหว่าง 20-55 ปี ณ วันที่สมัคร",
    ageRange: "ผู้สมัครต้องมีอายุระหว่าง 20-55 ปี ณ วันที่สมัคร",
  },
  province: {
    required: "กรุณาระบุ จังหวัดที่ทำงาน",
    min: "กรุณาระบุ จังหวัดที่ทำงาน",
  },
  postcode: {
    required: "กรุณาระบุ รหัสไปรษณีย์ที่ทำงาน",
    min: "กรุณาระบุ รหัสไปรษณีย์ที่ทำงาน",
  },

  salary: {
    required: "กรุณาระบุ รายได้ประจำต่อเดือน",
    min: "ผู้สมัครต้องมีรายได้ 7,000 บาทขึ้นไป",
  },
  career: {
    required: "กรุณาระบุ ลักษณะงาน",
    min: "กรุณาระบุ ลักษณะงาน",
  },
  company: {
    required: "กรุณาระบุ ชื่อบริษัท",
  },
  time: {
    required: "กรุณาระบุ เวลาที่สะดวก",
    min: "กรุณาระบุ เวลาที่สะดวก",
  },
  acceptTerm: {
    required: "",
    //   "กรุณายืนยันการอ่านและทำความเข้าใจเกี่ยวกับนโยบายคุ้มครองข้อมูลส่วนบุคคล",
  },

  idStaff: {
    minlength: "กรุณากรอกรหัสผู้แนะนำให้ถูกต้อง",
  },

  forStaff: {
    minlength: "กรุณากรอกรหัสให้ถูกต้อง",
  },
};
